Core/src/InformationRegisters/НастройкиКассыШтрихМ/НастройкиКассыШтрихМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиКассыШтрихМ</name>
  <resources>
    <name>ДатаНачалаЗапросаЧеков</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияЗапросаЧеков</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗапроситьЧекиНаСервереШтрихМ</name>
    <comment>(служебный) для обмена кассовыми чеками</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗарегистрированНаСервереШтрихМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗарегистрироватьТоварыНаСервереШтрихМ</name>
    <comment>(служебный) для обмена товарами</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторОбластиНаСервереШтрихМ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОчиститьТоварыНаСервереШтрихМ</name>
    <comment>(служебный) для обмена товарами</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПроверитьРегистрациюТоваровНаСервереШтрихМ</name>
    <comment>(служебный) для обмена товарами</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СерийныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Токен</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторТарификации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПрайсЛист</name>
    <type>
      <types>CatalogRef.ПрайсЛисты</types>
    </type>
  </resources>
  <resources>
    <name>СообщениеПриРегистрации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НДСВключатьВСтоимость</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </resources>
  <resources>
    <name>НалогообложениеНДС</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </resources>
  <resources>
    <name>СуммаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЭквайринговыйТерминал</name>
    <type>
      <types>CatalogRef.ЭквайринговыеТерминалы</types>
    </type>
  </resources>
  <resources>
    <name>ВидСкидкиНаценки</name>
    <type>
      <types>CatalogRef.ВидыСкидокНаценок</types>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </resources>
  <resources>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>ОтключенаЛицензия</name>
    <comment>Отключен на сервере тарификации</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>КассаККМ</name>
    <type>
      <types>CatalogRef.КассыККМ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/InformationRegisters/ОбластиДанных/ОбластиДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОбластиДанных</name>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыОбластейДанных</types>
    </type>
  </resources>
  <attributes>
    <name>Вариант</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторВыгрузки</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ОшибкаОбработки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Повтор</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:InformationRegister>

Core/src/Enums/СтатусыОбластейДанных/СтатусыОбластейДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыОбластейДанных</name>
  <enumValues>
    <name>Новая</name>
  </enumValues>
  <enumValues>
    <name>Используется</name>
  </enumValues>
  <enumValues>
    <name>КУдалению</name>
  </enumValues>
  <enumValues>
    <name>Удалена</name>
  </enumValues>
  <enumValues>
    <name>ИмпортИзФайла</name>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/ИерархияПрайсЛистов/ИерархияПрайсЛистов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ИерархияПрайсЛистов</name>
  <enumValues>
    <name>ИерархияНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ИерархияЦеновыхГрупп</name>
  </enumValues>
  <enumValues>
    <name>ИерархияКатегорийНоменклатуры</name>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/ВариантыПечатиПрайсЛиста/ВариантыПечатиПрайсЛиста.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыПечатиПрайсЛиста</name>
  <enumValues>
    <name>Полотно</name>
  </enumValues>
  <enumValues>
    <name>ДвеКолонки</name>
  </enumValues>
  <enumValues>
    <name>Диафильм</name>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/ТипыВидовЦен/ТипыВидовЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыВидовЦен</name>
  <enumValues>
    <name>Статический</name>
  </enumValues>
  <enumValues>
    <name>ДинамическийПроцент</name>
  </enumValues>
  <enumValues>
    <name>ДинамическийФормула</name>
  </enumValues>
</mdclass:Enum>

Core/src/Catalogs/ПрайсЛисты/ПрайсЛисты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПрайсЛисты</name>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантыСортировки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьДатуФормирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьКонтактнуюИнформацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьНоменклатуруБезЦен</name>
    <comment>Выводить номенклатуру даже в том случае, если нет установленных цен.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРасчетаКурсаВалюты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаФормирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИерархияСодержимого</name>
    <type>
      <types>EnumRef.ИерархияПрайсЛистов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзменятьРазмерПропорционально</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КартинкаВысота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КартинкаШирина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКолонок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НазваниеЦеныПредставлением</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтмечатьНовинки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодЦен</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПечатьПрайсЛиста</name>
    <type>
      <types>EnumRef.ВариантыПечатиПрайсЛиста</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоложениеТекстаОтносительноМеткиНовинка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>17</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеОстатков</name>
    <comment>1 - числом, 2 - ассоциативное представление</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстовоеПредставлениеОстатковДостаточно</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстовоеПредставлениеОстатковМало</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстовоеПредставлениеОстатковМного</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФормироватьПоНаличию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПредставлениеНоменклатуры</name>
    <attributes>
      <name>Использование</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>РеквизитНоменклатуры</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РеквизитПредставление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПараметрРасшифровки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ширина</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СлужебныйУправлениеВидимостью</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Номенклатура</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыЦен</name>
    <attributes>
      <name>ВидЦен</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КатегорииНоменклатуры</name>
    <attributes>
      <name>КатегорияНоменклатуры</name>
      <type>
        <types>CatalogRef.КатегорииНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЦеновыеГруппы</name>
    <attributes>
      <name>ЦеноваяГруппа</name>
      <type>
        <types>CatalogRef.ЦеновыеГруппы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Core/src/CommonModules/ИнтеграцияОбменШтрихМ/Module.bsl
// См. описание этой же процедуры в общем модуле
// ОчередьЗаданийПереопределяемый.
//
Процедура ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам) Экспорт
	
	СоответствиеИменПсевдонимам.Вставить(Метаданные.РегламентныеЗадания.ОбменДаннымиССерверомШтрихМ.ИмяМетода);
	СоответствиеИменПсевдонимам.Вставить(Метаданные.РегламентныеЗадания.ОбменТоваромССерверомШтрихМ.ИмяМетода);
	
	
КонецПроцедуры

// Возвращает реквизиты кассы ШтрихМ из регистра настройки кассы
//
Функция ПолучитьРеквизитыКассыШтрихМ(КассаККМ) Экспорт
	
	ДанныеКассы = Новый Структура(
	"ДатаНачалаЗапросаЧеков,
	|ДатаОкончанияЗапросаЧеков,
	|ЗапроситьЧекиНаСервереШтрихМ,
	|ЗарегистрированНаСервереШтрихМ,
	|ЗарегистрироватьТоварыНаСервереШтрихМ,
	|ИдентификаторОбластиНаСервереШтрихМ,
	|ОчиститьТоварыНаСервереШтрихМ,
	|ПроверитьРегистрациюТоваровНаСервереШтрихМ,
	|РегистрационныйНомер,
	|СерийныйНомер,
	|Токен,
	|ИдентификаторТарификации,
	|ПрайсЛист,
	|СообщениеПриРегистрации");
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	НастройкиКассыШтрихМ.ДатаНачалаЗапросаЧеков,
	|	НастройкиКассыШтрихМ.ДатаОкончанияЗапросаЧеков,
	|	НастройкиКассыШтрихМ.ЗапроситьЧекиНаСервереШтрихМ,
	|	НастройкиКассыШтрихМ.ЗарегистрированНаСервереШтрихМ,
	|	НастройкиКассыШтрихМ.ЗарегистрироватьТоварыНаСервереШтрихМ,
	|	НастройкиКассыШтрихМ.ИдентификаторОбластиНаСервереШтрихМ,
	|	НастройкиКассыШтрихМ.ОчиститьТоварыНаСервереШтрихМ,
	|	НастройкиКассыШтрихМ.ПроверитьРегистрациюТоваровНаСервереШтрихМ,
	|	НастройкиКассыШтрихМ.РегистрационныйНомер,
	|	НастройкиКассыШтрихМ.СерийныйНомер,
	|	НастройкиКассыШтрихМ.Токен,
	|	НастройкиКассыШтрихМ.ИдентификаторТарификации,
	|	НастройкиКассыШтрихМ.СообщениеПриРегистрации,
	|	НастройкиКассыШтрихМ.ПрайсЛист
	|ИЗ
	|	РегистрСведений.НастройкиКассыШтрихМ КАК НастройкиКассыШтрихМ
	|ГДЕ
	|	НастройкиКассыШтрихМ.КассаККМ = &КассаККМ");
	
	Запрос.УстановитьПараметр("КассаККМ", КассаККМ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ДанныеКассы, Выборка);
	КонецЕсли;
	
	Возврат ДанныеКассы;
	
КонецФункции

// Функция возвращает кассу по её регистрационному номеру из регистра настроек касс
//
// Параметры:
//  РегистрационныйНомер  - Строка - Регистрационный номер кассы
//
// Возвращаемое значение:
//   СправочникСсылка.КассыККМ   - Искомая по регномеру касса
//
Функция ПолучитьКассуПоРегистрационномуНомеру(РегистрационныйНомер)Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	НастройкиКассыШтрихМ.КассаККМ
	|ИЗ
	|	РегистрСведений.НастройкиКассыШтрихМ КАК НастройкиКассыШтрихМ
	|ГДЕ
	|	НастройкиКассыШтрихМ.РегистрационныйНомер = &РегистрационныйНомер");
	
	Запрос.УстановитьПараметр("РегистрационныйНомер", СокрЛП(РегистрационныйНомер));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.КассаККМ;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции // ПолучитьКассуПоРегистрационномуНомеру()

// Функция возвращает кассу по её регистрационному номеру из регистра настроек касс
//
// Параметры:
//  РегистрационныйНомер  - Строка - Регистрационный номер кассы
//
// Возвращаемое значение:
//   СправочникСсылка.КассыККМ   - Искомая по регномеру касса
//
Функция ПолучитьКассуПоИдентификаторуЛицензии(Лицензия)Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	НастройкиКассыШтрихМ.КассаККМ
	|ИЗ
	|	РегистрСведений.НастройкиКассыШтрихМ КАК НастройкиКассыШтрихМ
	|ГДЕ
	|	НастройкиКассыШтрихМ.ИдентификаторТарификации = &Лицензия");
	
	Запрос.УстановитьПараметр("Лицензия", СокрЛП(Лицензия));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.КассаККМ;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции // ПолучитьКассуПоРегистрационномуНомеру()

Процедура ВойтиВОбластьДанныхНаСервере(Знач ОбластьДанных) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОбщегоНазначения.УстановитьРазделениеСеанса(Истина, ОбластьДанных);
	
	НачатьТранзакцию();
	
	Попытка
		
		КлючОбласти = РаботаВМоделиСервиса.СоздатьКлючЗаписиРегистраСведенийВспомогательныхДанных(
			РегистрыСведений.ОбластиДанных,
			Новый Структура(РаботаВМоделиСервиса.РазделительВспомогательныхДанных(), ОбластьДанных));
		ЗаблокироватьДанныеДляРедактирования(КлючОбласти);
		
		Блокировка = Новый БлокировкаДанных;
		Элемент = Блокировка.Добавить("РегистрСведений.ОбластиДанных");
		Элемент.УстановитьЗначение("ОбластьДанныхВспомогательныеДанные", ОбластьДанных);
		Элемент.Режим = РежимБлокировкиДанных.Разделяемый;
		Блокировка.Заблокировать();
		
		МенеджерЗаписи = РегистрыСведений.ОбластиДанных.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ОбластьДанныхВспомогательныеДанные = ОбластьДанных;
		МенеджерЗаписи.Прочитать();
		Если Не МенеджерЗаписи.Выбран() Тогда
			МенеджерЗаписи.ОбластьДанныхВспомогательныеДанные = ОбластьДанных;
			МенеджерЗаписи.Статус = Перечисления.СтатусыОбластейДанных.Используется;
			МенеджерЗаписи.Записать();
		КонецЕсли;
		РазблокироватьДанныеДляРедактирования(КлючОбласти);
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
КонецПроцедуры

Процедура ВыйтиИзОбластиДанныхНаСервере() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОбщегоНазначения.УстановитьРазделениеСеанса(Ложь);
КонецПроцедуры

Функция ЗагрузитьДанныеОбменаИз1СКасса(ИмяФайла) Экспорт
	
	// при таком обмене не контролируем остатки
	Константы.КонтролироватьОстаткиПриПробитииЧековККМ.Установить(Ложь);
	Константы.ИспользоватьОбменСКассойMinikassir.Установить(Истина);
	Константы.ИспользоватьНесколькоОрганизаций.Установить(Истина);
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ИмяФайла);
	ЧтениеXML.Прочитать(); // Message
	ЧтениеXML.Прочитать(); // Header
	
	Header = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML, ФабрикаXDTO.Тип("http://www.1c.ru/SSL/Exchange/Message", "Header"));
	Если ЧтениеXML.ТипУзла <> ТипУзлаXML.НачалоЭлемента
		Или ЧтениеXML.ЛокальноеИмя <> "Body" Тогда
		
		ЗаписьЖурналаРегистрации(
			"Загрузка1СКасса.Загрузка1СКасса",
			УровеньЖурналаРегистрации.Ошибка,,, 
			НСтр("ka='Ошибка чтения сообщения загрузки. Неверный формат сообщения.';ru='Ошибка чтения сообщения загрузки. Неверный формат сообщения.';en='Read Error loading posts. Invalid message format.'"));
			
		Возврат Ложь;
	КонецЕсли;
	
	ФорматОбмена = РазложитьФорматОбмена(Header.Format);
	ВерсияФорматаДляЗагрузки = ФорматОбмена.Версия;
	КомпонентыОбмена = КомпонентыОбмена("Получение", ВерсияФорматаДляЗагрузки);
	КомпонентыОбмена.XMLСхема = Header.Format;

	
	ЧтениеXML.Прочитать(); // Body
	КомпонентыОбмена.Вставить("ФайлОбмена", ЧтениеXML);
	
	ОбменДаннымиXDTOСервер.ПроизвестиЧтениеДанных(КомпонентыОбмена);
	
	ЧтениеXML.Закрыть();
	Если КомпонентыОбмена.ФлагОшибки Тогда
				ЗаписьЖурналаРегистрации(
			"Загрузка1СКасса.Загрузка1СКасса",
			УровеньЖурналаРегистрации.Ошибка,,, 
			 НСтр("ka='В ходе выполнения операции возникли ошибки';ru='В ходе выполнения операции возникли ошибки';en='During the operation there were errors'") + ": " + Символы.ПС + КомпонентыОбмена.СтрокаСообщенияОбОшибке);
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция РазложитьФорматОбмена(Знач ФорматОбмена)
	
	Результат = Новый Структура("БазовыйФормат, Версия");
	
	ЭлементыФормата = СтрРазделить(ФорматОбмена, "/");
	
	Если ЭлементыФормата.Количество() = 0 Тогда
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ka='გაცვლის ფორმატის არაკანონიკური სახელი <%1>';ru='Неканоническое имя формата обмена <%1>';en='Noncanonical name exchange format <% 1>'"), ФорматОбмена);
	КонецЕсли;
	
	Результат.Версия = ЭлементыФормата[ЭлементыФормата.ВГраница()];
	
	Версии = СтрРазделить(Результат.Версия, ".");
	
	Если Версии.Количество() = 0 Тогда
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ka='გაცვლის ფორმატის ვერსიის არაკანონიკური წარდგენა: <%1>.';ru='Неканоническое представление версии формата обмена: <%1>.';en='Noncanonical representation version interchange format: <% 1>.'"), Результат.Версия);
	КонецЕсли;
	
	ЭлементыФормата.Удалить(ЭлементыФормата.ВГраница());
	
	Результат.БазовыйФормат = СтрСоединить(ЭлементыФормата, "/");
	
	Возврат Результат;
КонецФункции

// Выполняет подготовку структуры КомпонентыОбмена.
// Параметры:
//   НаправлениеОбмена - Строка - Отправка или Получение.
//   ВерсияФорматаОбменаПриЗагрузке - Строка - Версия формата, которая должна применяться при загрузке данных.
//
// Возвращаемое значение:
//   Структура - Компоненты обмена.
//
Функция КомпонентыОбмена(НаправлениеОбмена, ВерсияФорматаОбменаПриЗагрузке = "") Экспорт
	
	КомпонентыОбмена = ОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена(НаправлениеОбмена);
	ТекВерсияФормата = "1.4";
	КомпонентыОбмена.ЭтоОбменЧерезПланОбмена = Ложь;
	
	КомпонентыОбмена.КлючСообщенияЖурналаРегистрации = НСтр("ka='Перенос данных через буфер обмена';ru='Перенос данных через буфер обмена';en='Transfer of data via the clipboard'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
	КомпонентыОбмена.ВерсияФорматаОбмена = "1.4";
	КомпонентыОбмена.XMLСхема = "http://v8.1c.ru/edi/edi_stnd/EnterpriseData/" + ТекВерсияФормата;
	
	РежимРаботы = ОбщегоНазначенияПовтИсп.РежимРаботыПрограммы();
	РежимРаботы = Новый ФиксированнаяСтруктура(РежимРаботы);
	МенеджерОбменаВнутренний = Истина;
	
	Если МенеджерОбменаВнутренний Тогда
		ВерсииФорматаОбмена = Новый Соответствие;
		ОбменДаннымиПереопределяемый.ПриПолученииДоступныхВерсийФормата(ВерсииФорматаОбмена);
		КомпонентыОбмена.МенеджерОбмена = ВерсииФорматаОбмена.Получить(ТекВерсияФормата);
		Если КомпонентыОбмена.МенеджерОбмена = Неопределено Тогда
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ka='Не поддерживается версия формата обмена: <%1>.';ru='Не поддерживается версия формата обмена: <%1>.';en='Not supported version interchange format: <% 1>.'"), ТекВерсияФормата);
		КонецЕсли;
	КонецЕсли;
	
	ОбменДаннымиXDTOСервер.ИнициализироватьТаблицыПравилОбмена(КомпонентыОбмена);
	
	Возврат КомпонентыОбмена;
	
КонецФункции

Функция ПолучитьПрайсЛистПоУмолчанию(Организация) Экспорт
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПрайсЛист.Ссылка КАК ПрайсЛист
	|ИЗ Справочник.ПрайсЛисты КАК ПрайсЛист
	|ГДЕ ПрайсЛист.Наименование = ""Прайс-лист кассы Штрих-М""");

	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() Тогда
		Возврат Выборка.ПрайсЛист;
	Иначе
		НовыйПрайсЛист = Справочники.ПрайсЛисты.СоздатьЭлемент();
		НовыйПрайсЛист.Наименование = "Прайс-лист кассы Штрих-М";
		НовыйПрайсЛист.Валюта = Константы.НациональнаяВалюта.Получить();
		НовыйПрайсЛист.Организация = Организация;
		НовыйПрайсЛист.ИерархияСодержимого = Перечисления.ИерархияПрайсЛистов.ИерархияНоменклатуры;
		НовыйПрайсЛист.ПечатьПрайсЛиста = Перечисления.ВариантыПечатиПрайсЛиста.Полотно;
		СтрокаВидаЦены = НовыйПрайсЛист.ВидыЦен.Добавить();
		СтрокаВидаЦены.ВидЦен = РозничныйВидЦены(Неопределено);
		
		НоваяСтрокаПредставления = НовыйПрайсЛист.ПредставлениеНоменклатуры.Добавить();
		НоваяСтрокаПредставления.Использование = Истина;
		НоваяСтрокаПредставления.РеквизитНоменклатуры = "Артикул";
		НоваяСтрокаПредставления.РеквизитПредставление = "Артикул";
		
		НоваяСтрокаПредставления = НовыйПрайсЛист.ПредставлениеНоменклатуры.Добавить();
		НоваяСтрокаПредставления.Использование = Истина;
		НоваяСтрокаПредставления.РеквизитНоменклатуры = "Наименование";
		НоваяСтрокаПредставления.РеквизитПредставление = "Наименование";
		
		НовыйПрайсЛист.Записать();
		
		Возврат НовыйПрайсЛист.Ссылка;
		
	КонецЕсли;
КонецФункции

Функция РозничныйВидЦены(КассовыйАппарат = Неопределено) Экспорт
	
	Если КассовыйАппарат <> Неопределено Тогда
		ПрайсЛистКассы = ПолучитьРеквизитыКассыШтрихМ(КассовыйАппарат).ПрайсЛист;
		
				// Определение вида цены прайслиста
		Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПрайсЛистыВидыЦен.ВидЦен
		|ИЗ
		|	Справочник.ПрайсЛисты.ВидыЦен КАК ПрайсЛистыВидыЦен
		|ГДЕ
		|	ПрайсЛистыВидыЦен.Ссылка = &Ссылка");
		
		Запрос.УстановитьПараметр("Ссылка", ПрайсЛистКассы);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			ВидЦены = Выборка.ВидЦен;
		Иначе
			ВидЦены = ИнтеграцияОбменШтрихМ.РозничныйВидЦены();
		КонецЕсли;
		
		Возврат ВидЦены;
		
	КонецЕсли;
	
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ВидыЦен.Ссылка КАК ВидЦен
	|ИЗ
	|	Справочник.ВидыЦен КАК ВидыЦен
	|ГДЕ
	|	(ВидыЦен.Наименование = ""Розничные""
	|			ИЛИ ВидыЦен.Наименование = ""Розничная""
	|			ИЛИ ВидыЦен.Наименование = ""Розничная цена"")");
	
	// найден вид цен с названием розничные, розничная
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ВидЦеныКассы = Выборка.ВидЦен;
		Возврат ВидЦеныКассы;
	КонецЕсли;
	
	
	РозничнаяЦена = Справочники.ВидыЦен.СоздатьЭлемент();
	РозничнаяЦена.Наименование = "Розничная";
	РозничнаяЦена.ВалютаЦены = Константы.НациональнаяВалюта.Получить();
	РозничнаяЦена.ЦенаВключаетНДС = Истина;
	РозничнаяЦена.ТипВидаЦен = Перечисления.ТипыВидовЦен.Статический;
	РозничнаяЦена.ПорядокОкругления = 1;
	РозничнаяЦена.ФорматЦены = "ЧЦ=15; ЧДЦ=2";
	РозничнаяЦена.ИдентификаторФормул = "Розничная";
	
	РозничнаяЦена.Записать();
	
	Возврат РозничнаяЦена.Ссылка;
	
КонецФункции

Функция ВключитьРозничныеПродажи() Экспорт
	
	Константы.ФункциональнаяОпцияУчетРозничныхПродаж.Установить(Истина);
	Константы.ФункциональнаяОпцияЛегкиеРозничныеПродажи.Установить(Истина);
	Константы.КонтролироватьОстаткиПриПробитииЧековККМ.Установить(Ложь);
	
КонецФункции

// Выполняет попытку отмены регистрации на сервере тарификации кассового аппарата.
//
// Параметры:
//  Ссылка - СправочникСсылка.КассовыеАппараты - ссылка на кассовый аппарат.
//  УдалениеОбъекта - Булево - флаг удаления кассового аппарата.
//
// Возвращаемое значение:
//  Булево - флаг успешной отмены регистрации.
//
Функция ОтменаРегистрацииКассыНаСервереТарификации(ИдентификаторЛицензии, УдалениеОбъекта = Истина, ОтменитьДляВсехОбластей = Ложь, КодОбластиДанных = 0) Экспорт
	
	// Тариф проверям только во Фреше.
	Если НЕ ОбщегоНазначенияПовтИсп.РазделениеВключено() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторЛицензии) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ИдентификаторОперации = Новый УникальныйИдентификатор;
	
	ТарифноеОграничение = ТарификацияПереопределяемый.ОграничениеКоличествоКассПоТарифу();
	
	ЛицензияИспользуется = ПроверкаИспользованияЛицензииКоличествоКасс(ИдентификаторЛицензии, ТарифноеОграничение);
	
	Если ЛицензияИспользуется = Неопределено Тогда
		Возврат Истина;
	Иначе
		Если Не ЛицензияИспользуется Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	Попытка
		Если ОбщегоНазначенияПовтИсп.СеансЗапущенБезРазделителей() Тогда
			Результат = Тарификация.ОсвободитьЛицензиюУникальнойУслуги(ТарифноеОграничение.Поставщик,
				ТарифноеОграничение.Идентификатор,
				ИдентификаторЛицензии,
				ИдентификаторОперации, КодОбластиДанных,, ОтменитьДляВсехОбластей);
		Иначе
			Результат = Тарификация.ОсвободитьЛицензиюУникальнойУслуги(ТарифноеОграничение.Поставщик,
				ТарифноеОграничение.Идентификатор,
				ИдентификаторЛицензии,
				ИдентификаторОперации,,, ОтменитьДляВсехОбластей);
		КонецЕсли;
		Если Результат Тогда
			Тарификация.ПодтвердитьОперацию(ИдентификаторОперации);
			Возврат Истина;
		Иначе
			Тарификация.ОтменитьОперацию(ИдентификаторОперации);
			Возврат Ложь;
		КонецЕсли;
	Исключение
		Возврат Ложь;
	КонецПопытки;
КонецФункции

Функция ПроверкаИспользованияЛицензииКоличествоКасс(ИдентификаторЛицензии, ТарифноеОграничение = Неопределено)
	
	ЛицензияИспользуется = Неопределено;
	
	Если ТарифноеОграничение = Неопределено Тогда
		ТарифноеОграничение = ТарификацияПереопределяемый.ОграничениеКоличествоКассПоТарифу();
	КонецЕсли;
	
	Попытка
		ЛицензияИспользуется = Тарификация.ЗарегистрированаЛицензияУникальнойУслуги(ТарифноеОграничение.Поставщик,
			ТарифноеОграничение.Идентификатор,
			ИдентификаторЛицензии);
	Исключение
		ЛицензияИспользуется = Неопределено;
	КонецПопытки;
	
	Возврат ЛицензияИспользуется;
КонецФункции

// С помощью менеджера сервиса отправляет ответственному 
// письмо о новому абоненте из приложения 1С:Касса
Функция ОтправитьПисьмоОНовомАбонентеИз1СКасса() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		
		КодОбласти 	= ОбщегоНазначения.ЗначениеРазделителяСеанса();
		Прокси 		= ПолучитьПроксиМенеджераСервиса();
		КлючОбласти = Константы["КлючОбластиДанных"].Получить();
		АдресПочты  = Константы.ЭлектроннаяПочтаОтвественногоПерехода1СКасса.Получить();
		
		Если ПустаяСтрока(АдресПочты) Тогда
			ИмяСобытия = НСтр("ka='Загрузка1СКасса.Загрузка1СКасса';ru='Загрузка1СКасса.Загрузка1СКасса';en='Zagruzka1SKassa.Zagruzka1SKassa'", 
				ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
				
			Комментарий = НСтр("ka='Не установлен адрес электронной почты получателя уведомления о новом пользователе из 1С:Кассы';ru='Не установлен адрес электронной почты получателя уведомления о новом пользователе из 1С:Кассы';en='Do not set the destination email address for the new user notification of 1C: Cashier'",
				ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
			
			ЗаписьЖурналаРегистрации(
				ИмяСобытия ,
				УровеньЖурналаРегистрации.Ошибка,,,
				Комментарий);
			
			Возврат Ложь;
		КонецЕсли;
		
		Результат = Прокси.IsSupportedByShtrihM(КодОбласти);
		
		// письма рассылаются только в случае, если обслуживающая организация Штрих-М
		Если НЕ Результат Тогда
			
			ИмяСобытия = НСтр("ka='Загрузка1СКасса.Загрузка1СКасса';ru='Загрузка1СКасса.Загрузка1СКасса';en='Zagruzka1SKassa.Zagruzka1SKassa'", 
				ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
				
			ЗаписьЖурналаРегистрации(
				ИмяСобытия ,
				УровеньЖурналаРегистрации.Информация,,,
				НСтр("ka='Абонент не принадлежит Штрих-М';ru='Абонент не принадлежит Штрих-М';en='The subscriber does not belong to Bar-M'"));

			
			Возврат Истина;
		КонецЕсли;
		
		Результат = Прокси.SendLetterToPerson(
			КодОбласти, 
			КлючОбласти,
			АдресПочты);
			
		Если НЕ ПустаяСтрока(Результат) Тогда
			ИмяСобытия = НСтр("ka='Загрузка1СКасса.Загрузка1СКасса';ru='Загрузка1СКасса.Загрузка1СКасса';en='Zagruzka1SKassa.Zagruzka1SKassa'", 
				ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
				
			ЗаписьЖурналаРегистрации(
				ИмяСобытия ,
				УровеньЖурналаРегистрации.Ошибка,,,
				Результат);
			
			Возврат Ложь;
		КонецЕсли;
		
	Исключение
		
		ИмяСобытия = НСтр("ka='Загрузка1СКасса.Загрузка1СКасса';ru='Загрузка1СКасса.Загрузка1СКасса';en='Zagruzka1SKassa.Zagruzka1SKassa'", 
			ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
			
		Комментарий = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
		ЗаписьЖурналаРегистрации(
			ИмяСобытия ,
			УровеньЖурналаРегистрации.Ошибка,,,
			Комментарий);
			
		
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьПроксиМенеджераСервиса()
	
	МодульРаботаВМоделиСервиса = ОбщегоНазначения.ОбщийМодуль("РаботаВМоделиСервиса");
	
	Адрес 	= МодульРаботаВМоделиСервиса.ВнутреннийАдресМенеджераСервиса() + "/ws/PrivateAPI?wsdl";
	Логин 	= МодульРаботаВМоделиСервиса.ИмяСлужебногоПользователяМенеджераСервиса();
	Пароль 	= МодульРаботаВМоделиСервиса.ПарольСлужебногоПользователяМенеджераСервиса();
	
	Опр = Новый WSОпределения(Адрес, Логин, Пароль);
	Прокси = Новый WSПрокси(Опр, "http://www.1c.ru/1cFresh/PrivateAPI/1.0", "PrivateAPI", "PrivateAPISoap");
	Прокси.Пользователь = Логин;
	Прокси.Пароль = Пароль;
	Возврат Прокси;
	
КонецФункции
